In [1]:
import re
import gc
import glob

import pandas as pd
import numpy as np

In [2]:
file_list = sorted(glob.glob('data/enavi*.csv'))

display(len(file_list), file_list)

18

['data\\enavi201904(6875).csv',
 'data\\enavi201905(6875).csv',
 'data\\enavi201906(6875).csv',
 'data\\enavi201907(6875).csv',
 'data\\enavi201908(6875).csv',
 'data\\enavi201909(6875).csv',
 'data\\enavi201910(6875).csv',
 'data\\enavi201911(6875).csv',
 'data\\enavi201912(6875).csv',
 'data\\enavi202001(6875).csv',
 'data\\enavi202002(6875).csv',
 'data\\enavi202003(6875).csv',
 'data\\enavi202004(6875).csv',
 'data\\enavi202005(6875).csv',
 'data\\enavi202006(6875).csv',
 'data\\enavi202007(6875).csv',
 'data\\enavi202008(6875).csv',
 'data\\enavi202009(6875).csv']

# SQLServerへのインポート前準備

### データの読み込み

In [3]:
use_cols_llist = ['利用日', '利用店名・商品名', '利用者', '支払方法', '利用金額', '支払手数料', '支払総額']
df_list = [pd.read_csv(path)[use_cols_llist] for path in file_list]

# 利用日が欠損値の行を削除
df_list = [df.dropna(subset=['利用日']) for df in df_list]

# 欠損値をNoneで補完
df_list = [df.where(df.notnull(), None) for df in df_list]

In [4]:
for df in df_list:
    display(df.shape,df.head(1))

(54, 7)

          利用日      利用店名・商品名 利用者  支払方法    利用金額  支払手数料    支払総額
0  2019/03/30  AMAZON.CO.JP  本人  1回払い  1782.0    0.0  1782.0

(33, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2019/04/30  ﾏｲﾊﾞｽｹﾂﾄ ｼﾓﾒｸﾞﾛ2ﾁ  本人  1回払い  1857      0  1857

(29, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2019/05/31  ｺｺｶﾗﾌｱｲﾝ  本人  1回払い  1736      0  1736

(38, 7)

          利用日           利用店名・商品名 利用者  支払方法   利用金額  支払手数料   支払総額
0  2019/06/30  ﾏｲﾊﾞｽｹﾂﾄ ｼﾓﾒｸﾞﾛ2ﾁ  本人  1回払い  894.0    0.0  894.0

(60, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2019/07/31  ﾌｱﾐﾘ-ﾏ-ﾄｴｲﾁﾋﾟ-ｴｽﾊ  本人  1回払い  1037      0  1037

(42, 7)

          利用日      利用店名・商品名 利用者  支払方法   利用金額  支払手数料   支払総額
0  2019/08/31  AMAZON.CO.JP  本人  1回払い  445.0    0.0  445.0

(64, 7)

          利用日           利用店名・商品名 利用者  支払方法   利用金額  支払手数料   支払総額
0  2019/09/30  ｼﾞｪｲｱｰﾙﾋｶﾞｼﾆﾎﾝ ﾃｲ  本人  1回払い  16580      0  16580

(47, 7)

          利用日           利用店名・商品名 利用者  支払方法   利用金額  支払手数料   支払総額
0  2019/10/31  ﾔﾌｰ ﾒｸﾞﾛｸﾄｸﾍﾞﾂｸﾐﾝ  本人  1回払い  85635      0  85635

(63, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2019/11/30  ﾌｱﾐﾘ-ﾏ-ﾄｲｽﾞﾔｼﾓﾒｸﾞ  本人  1回払い   781      0   781

(55, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2019/12/31  ﾏｲﾊﾞｽｹﾂﾄ ｼﾓﾒｸﾞﾛ2ﾁ  本人  1回払い   820      0   820

(50, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/01/31  ﾌｱﾐﾘ-ﾏ-ﾄﾕｳﾗｸﾁﾖｳｴｷ  本人  1回払い  1171      0  1171

(54, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/02/29  ﾏｲﾊﾞｽｹﾂﾄ ｼﾓﾒｸﾞﾛ2ﾁ  本人  1回払い  1045      0  1045

(57, 7)

          利用日           利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/03/31  ﾌｱﾐﾘ-ﾏ-ﾄｲｽﾞﾔｼﾓﾒｸﾞ  本人  1回払い   391      0   391

(43, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/04/30  ﾄｳｷﾕｳｽﾄｱ  本人  1回払い  2026      0  2026

(37, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/05/31  ﾄｳｷﾕｳｽﾄｱ  本人  1回払い   622      0   622

(41, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/06/30  ﾄｳｷﾕｳｽﾄｱ  本人  1回払い  1367      0  1367

(47, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/07/31  ﾄｳｷﾕｳｽﾄｱ  本人  1回払い  1010      0  1010

(54, 7)

          利用日  利用店名・商品名 利用者  支払方法  利用金額  支払手数料  支払総額
0  2020/08/31  ﾄｳｷﾕｳｽﾄｱ  本人  1回払い   804      0   804

In [5]:
gc.collect()

14

In [6]:
# SQLServerにインポートするカラムをデータ型毎に分ける
date_col_list = ['利用日']
nvarchar_col_list = ['利用店名・商品名', '利用者', '支払方法']
numeric_col_list = ['利用金額', '支払手数料', '支払総額']

display(len(use_cols_llist), len(date_col_list+nvarchar_col_list+numeric_col_list))

7

7

In [7]:
# SQLServerにインポートする関数一式
def main_import_data_to_sqlserver(database, df, file_name,date_col_list, nvarchar_col_list, numeric_col_list):
    '''
    関数内容
    ・予め読み込んだデータをSQLServerにインポートする関数
    Input
    ・database：テーブルをインポートしたいデータベース名
    ・df：インポートしたいテーブル(データフレーム)
    ・file_name:インポートしたいテーブルの名前
    ・date_col_list：DATE型としてインポートしたいカラム名を格納したリスト
    ・nvarchar_col_list：NVARCHAR型としてインポートしたいカラム名を格納したリスト
    ・numeric_col_list：NUMERIC型としてインポートしたいカラム名を格納したリスト
    関数使用方法
    for df, file_name in zip(df_list1, file_name_list):
        main_import_data_to_sqlserver('210_tbl',df,file_name,date_col_list,nvarchar_col_list,numeric_col_list)
    '''
    # 1
    dtypes_df = extract_colname_and_dtype_from_dataframe(df,date_col_list,nvarchar_col_list,numeric_col_list)
    # 2
    conn, curs = connect_to_sqlserver(database)
    # 3
    colname_and_dtype_str = get_colname_and_dtype_to_create_table(dtypes_df)
    # 4
    create_tables_in_sqlserver(file_name, colname_and_dtype_str, curs=curs, conn=conn)
    # 5
    it_col_str, questionmark_str = get_colname_and_questionmark_to_insert_data(dtypes_df)
    # 6
    insert_into_sqlserver(file_name, df, it_col_str, questionmark_str,curs=curs, conn=conn)
    # 7
    disconnect_from_sqlserver(curs=curs, conn=conn)


# 1
def extract_colname_and_dtype_from_dataframe(df,date_col_list,nvarchar_col_list,numeric_col_list):
    '''
    関数内容
    ・読み込んだデータのカラム名とデータ型を抽出し、データ型はSQLServerへのインポート用のデータ型名に変換してそれらをデータフレームに格納する関数
    '''
    dtypes_df = pd.DataFrame(df.dtypes).reset_index()
    dtypes_df.columns=['カラム名','データ型']

    for i in range(len(dtypes_df)):
        if dtypes_df.loc[i,'カラム名'] in date_col_list:
            dtypes_df.loc[i,'データ型'] = 'DATE'
        elif dtypes_df.loc[i,'カラム名'] in nvarchar_col_list:
            dtypes_df.loc[i,'データ型'] = 'NVARCHAR(255)'
        elif dtypes_df.loc[i,'カラム名'] in numeric_col_list:
            dtypes_df.loc[i,'データ型'] = 'NUMERIC(25,2)'
        else:
            pass
    

    return dtypes_df

# 2
def connect_to_sqlserver(database, driver='{SQL Server}', server = 'localhost\SQLEXPRESS',trusted_connection='yes'):
    '''
    関数内容
    ・PythonからSQLserverへ接続する関数
    Input
    ・database：使用するデータベース名(予めSQLserver上で「CREATE DATABASE [データベース名]」というコードを実行させて作成しておく)
    関数使用方法
    ・connect_to_sqlserver('C10000_database')
    '''
    import pyodbc
    conn = pyodbc.connect('DRIVER='+driver+';SERVER='+server+';DATABASE='+database+';Trusted_Connection='+trusted_connection+';')
    curs = conn.cursor()
    
    return conn, curs

# 3
def get_colname_and_dtype_to_create_table(df):
    '''
    関数内容
    ・create tableに必要なカラム名とデータ型を取得し、2つを特定の形式に並べた文字列を作成する関数
    '''

    ct_col_list = df['カラム名'].tolist()
    
    # カラム名に記号や数字が含まれているとSQLServerへのインポート時にエラーが発生するのでリネーム
    ct_col_list =['['+ col_name + ']'  for col_name in ct_col_list]

    ct_dtype_list = df['データ型'].tolist()

    combi_ct_list = [str(col_name)+' '+str(dtype_name) for col_name, dtype_name in zip (ct_col_list, ct_dtype_list)]

    colname_and_dtype_str = ','.join(map(str, combi_ct_list))

    return colname_and_dtype_str

# 4
def create_tables_in_sqlserver(file_name, colname_and_dtype_str, curs, conn):
    '''
    関数内容
    ・データベース内にテーブルを作成する関数
    '''
    #for file_name in file_name_list:
    
    print(file_name+'テーブルをSQLServerに作成します。')
    #print(colname_and_dtype_str)
    curs.execute(
    'CREATE TABLE ' + file_name +\
    '(' + colname_and_dtype_str +')')
    print(file_name+'テーブルをSQLServerに作成し終えました。')

    conn.commit()

# 5       
def get_colname_and_questionmark_to_insert_data(df):
    '''
    関数内容
    ・insert intoに必要なカラム名と?マークを取得する関数
    '''
    
    it_col_list = df['カラム名'].tolist()
    
    # カラム名に記号や数字が含まれているとSQLServerへのインポート時にエラーが発生するのでリネーム
    it_col_list =['['+ col_name + ']'  for col_name in it_col_list]
    
    it_col_str = ','.join(map(str, it_col_list))

    questionmark_str = '?,'*len(df)
    # 最後の「,」は必要ない + ()を追加
    questionmark_str = '(' + questionmark_str[:-1] + ')'

    return it_col_str, questionmark_str

# 6
def insert_into_sqlserver(file_name, df, it_col_str, questionmark_str, curs, conn):
    '''
    関数内容
    ・データベース内のテーブルにデータを追加する関数
    '''

    #for file_name, df in zip(file_name_list, df_list):
    
    print(file_name+'テーブルにデータを格納します。')
    
    values_tuple = [tuple(row) for row in df.values]
    # カラムが複数ある結果、挿入したい値が複数ある場合はcurs.executemanyを使う
    curs.executemany(
        'INSERT INTO ' + file_name +'(' + it_col_str + ')'+ 'VALUES ' + questionmark_str ,values_tuple
    )
    print(file_name+'テーブルにデータを格納し終えました。')

    conn.commit()

# 7
def disconnect_from_sqlserver(curs, conn):
    '''
    関数内容
    ・SQLserverへの接続を切る関数
    '''
    #conn, curs = connect_to_sqlserver()

    curs.close()
    conn.close()

# SQLServerへのインポート

In [8]:
table_name_list = [name.split('\\')[1].split('(')[0] for name in file_list]

table_name_list

['enavi201904',
 'enavi201905',
 'enavi201906',
 'enavi201907',
 'enavi201908',
 'enavi201909',
 'enavi201910',
 'enavi201911',
 'enavi201912',
 'enavi202001',
 'enavi202002',
 'enavi202003',
 'enavi202004',
 'enavi202005',
 'enavi202006',
 'enavi202007',
 'enavi202008',
 'enavi202009']

In [9]:
# 関数実行
for df, table_name in zip(df_list, table_name_list):
        main_import_data_to_sqlserver('FeeForUsingCreditCard2', df, table_name, date_col_list, nvarchar_col_list, numeric_col_list)

enavi201904テーブルをSQLServerに作成します。
enavi201904テーブルをSQLServerに作成し終えました。
enavi201904テーブルにデータを格納します。
enavi201904テーブルにデータを格納し終えました。
enavi201905テーブルをSQLServerに作成します。
enavi201905テーブルをSQLServerに作成し終えました。
enavi201905テーブルにデータを格納します。
enavi201905テーブルにデータを格納し終えました。
enavi201906テーブルをSQLServerに作成します。
enavi201906テーブルをSQLServerに作成し終えました。
enavi201906テーブルにデータを格納します。
enavi201906テーブルにデータを格納し終えました。
enavi201907テーブルをSQLServerに作成します。
enavi201907テーブルをSQLServerに作成し終えました。
enavi201907テーブルにデータを格納します。
enavi201907テーブルにデータを格納し終えました。
enavi201908テーブルをSQLServerに作成します。
enavi201908テーブルをSQLServerに作成し終えました。
enavi201908テーブルにデータを格納します。
enavi201908テーブルにデータを格納し終えました。
enavi201909テーブルをSQLServerに作成します。
enavi201909テーブルをSQLServerに作成し終えました。
enavi201909テーブルにデータを格納します。
enavi201909テーブルにデータを格納し終えました。
enavi201910テーブルをSQLServerに作成します。
enavi201910テーブルをSQLServerに作成し終えました。
enavi201910テーブルにデータを格納します。
enavi201910テーブルにデータを格納し終えました。
enavi201911テーブルをSQLServerに作成します。
enavi201911テーブルをSQLServerに作成し終えました。
enavi201911テーブルにデータを格納します。
enavi201911テーブルにデータを格納し終えました。
enavi201912テーブルをSQLServerに作成します。
enavi201912テーブルをSQLServerに作成し終えました。
enavi201912テーブルにデータを格納します。
enavi201912テーブルにデータを格納し終えました。
enavi202001テーブルをSQLServerに作成します。
enavi202001テーブルをSQLServerに作成し終えました。
enavi202001テーブルにデータを格納します。
enavi202001テーブルにデータを格納し終えました。
enavi202002テーブルをSQLServerに作成します。
enavi202002テーブルをSQLServerに作成し終えました。
enavi202002テーブルにデータを格納します。
enavi202002テーブルにデータを格納し終えました。
enavi202003テーブルをSQLServerに作成します。
enavi202003テーブルをSQLServerに作成し終えました。
enavi202003テーブルにデータを格納します。
enavi202003テーブルにデータを格納し終えました。
enavi202004テーブルをSQLServerに作成します。
enavi202004テーブルをSQLServerに作成し終えました。
enavi202004テーブルにデータを格納します。
enavi202004テーブルにデータを格納し終えました。
enavi202005テーブルをSQLServerに作成します。
enavi202005テーブルをSQLServerに作成し終えました。
enavi202005テーブルにデータを格納します。
enavi202005テーブルにデータを格納し終えました。
enavi202006テーブルをSQLServerに作成します。
enavi202006テーブルをSQLServerに作成し終えました。
enavi202006テーブルにデータを格納します。
enavi202006テーブルにデータを格納し終えました。
enavi202007テーブルをSQLServerに作成します。
enavi202007テーブルをSQLServerに作成し終えました。
enavi202007テーブルにデータを格納します。
enavi202007テーブルにデータを格納し終えました。
enavi202008テーブルをSQLServerに作成します。
enavi202008テーブルをSQLServerに作成し終えました。
enavi202008テーブルにデータを格納します。
enavi202008テーブルにデータを格納し終えました。
enavi202009テーブルをSQLServerに作成します。
enavi202009テーブルをSQLServerに作成し終えました。
enavi202009テーブルにデータを格納します。
enavi202009テーブルにデータを格納し終えました。

In [10]:
gc.collect()

175

以下、各関数の実行内容の確認

In [12]:
d_df = extract_colname_and_dtype_from_dataframe(df_list[0],date_col_list,nvarchar_col_list,numeric_col_list)

d_df

       カラム名           データ型
0       利用日           DATE
1  利用店名・商品名  NVARCHAR(255)
2       利用者  NVARCHAR(255)
3      支払方法  NVARCHAR(255)
4      利用金額  NUMERIC(25,2)
5     支払手数料  NUMERIC(25,2)
6      支払総額  NUMERIC(25,2)

In [13]:
#3
get_colname_and_dtype_to_create_table(d_df)

'[利用日] DATE,[利用店名・商品名] NVARCHAR(255),[利用者] NVARCHAR(255),[支払方法] NVARCHAR(255),[利用金額] NUMERIC(25,2),[支払手数料] NUMERIC(25,2),[支払総額] NUMERIC(25,2)'

In [14]:
# 5
get_colname_and_questionmark_to_insert_data(d_df)

('[利用日],[利用店名・商品名],[利用者],[支払方法],[利用金額],[支払手数料],[支払総額]', '(?,?,?,?,?,?,?)')